tutorials/viscoelastic/viscoelasticFluidFoam/Giesekus/constant/viscoelasticProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viscoelasticProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
From:
AZAIEZ, J.; GUÉNETTE, R.; AIT-KADI, A. Entry flow calculations using multi-mode
models. Journal of Non-Newtonian Fluid Mechanics, v. 66, n. 2-3, p. 271 - 281, 1996.

Mode        Model parameter      lambda   etaP    etaS
1           0.5                  0.6855   0.0400  0.002
2           0.2                  0.1396   0.2324  0.002
3           0.3                  0.0389   0.5664  0.002
4           0.2                  0.0059   0.5850  0.002

*/

rheology
{

        type multiMode;

        models
        (
            first
            {
            type Giesekus;
            rho              rho [1 -3 0 0 0 0 0] 803.87097;
            etaS             etaS [1 -1 -1 0 0 0 0] 0.002;
            etaP             etaP [1 -1 -1 0 0 0 0] 0.04;
            lambda           lambda [0 0 1 0 0 0 0] 0.6855;
            alpha            alpha [0 0 0 0 0 0 0] 0.5;
            }

            second
            {
            type Giesekus;
            rho              rho [1 -3 0 0 0 0 0] 803.87097;
            etaS             etaS [1 -1 -1 0 0 0 0] 0.002;
            etaP             etaP [1 -1 -1 0 0 0 0] 0.2324;
            lambda           lambda [0 0 1 0 0 0 0] 0.1396;
            alpha            alpha [0 0 0 0 0 0 0] 0.2;
            }

            third
            {
            type Giesekus;
            rho              rho [1 -3 0 0 0 0 0] 803.87097;
            etaS             etaS [1 -1 -1 0 0 0 0] 0.002;
            etaP             etaP [1 -1 -1 0 0 0 0] 0.5664;
            lambda           lambda [0 0 1 0 0 0 0] 0.0389;
            alpha            alpha [0 0 0 0 0 0 0] 0.3;
            }

            fourth
            {
            type Giesekus;
            rho              rho [1 -3 0 0 0 0 0] 803.87097;
            etaS             etaS [1 -1 -1 0 0 0 0] 0.002;
            etaP             etaP [1 -1 -1 0 0 0 0] 0.5850;
            lambda           lambda [0 0 1 0 0 0 0] 0.0059;
            alpha            alpha [0 0 0 0 0 0 0] 0.2;
            }

        );

}

// ************************************************************************* //
